In [1]:
import pandas as pd

In [4]:
df= pd.read_csv("EmployeeAttrition.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

In [3]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

# Q1

In [7]:
len(df.index)

1470

# Q2

In [8]:
df['MonthlyIncome'].mean()

6502.931292517007

# Q3

In [22]:
df['HourlyRate'].max()

100

# Q4

In [23]:
df.loc[df['EmployeeNumber']==10][['EmployeeNumber','Department', 'JobRole', 'MaritalStatus', 'OverTime']]

,EmployeeNumber,Department,JobRole,MaritalStatus,OverTime
6,10,Research & Development,Laboratory Technician,Married,Yes

# Q5

In [25]:
df.loc[df['MonthlyIncome']==df['MonthlyIncome'].max()]['EmployeeNumber']

190    259
Name: EmployeeNumber, dtype: int64

# Q6

In [28]:
df.loc[df['Age']>58].groupby('Age')['DailyRate'].mean()

Age
59    992.3
60    833.2
Name: DailyRate, dtype: float64

# Q7

In [30]:
df.EducationField.unique()

array(['Life Sciences', 'Other', 'Medical', 'Marketing',
       'Technical Degree', 'Human Resources'], dtype=object)

# Q8

In [44]:
df1 = df.groupby('JobRole').size().reset_index().sort_values(0,ascending=False)
df1.head()

                     JobRole    0
7            Sales Executive  326
6         Research Scientist  292
2      Laboratory Technician  259
4     Manufacturing Director  145
0  Healthcare Representative  131

# Q9

In [50]:
df1=df1.rename(columns={0:"count"})
df1.loc[df1['count']<100]

                JobRole  count
8  Sales Representative     83
5     Research Director     80
1       Human Resources     52

# Q10

In [52]:
 df[['Education','JobSatisfaction']].corr()

                 Education  JobSatisfaction
Education         1.000000        -0.011296
JobSatisfaction  -0.011296         1.000000